#引入模块----------------------------------
import numpy as np
#------------------------------------------

#自定义模块--------------------------------
from visiualization import Visiualization
from environment import Environment
from train import Train
from read_and_write_file import ReadAndWritefile
#------------------------------------------

#注意事项----------------------------------
# 1.所有的输入和输出为角度制
# 2.所有数据保留三维小数
#------------------------------------------

#                    _ooOoo_
#                   o8888888o
#                   88" . "88
#                   (| -_- |)
#                   O\  =  /O
#                ____/`---'\____
#              .'  \\|     |//  `.
#             /  \\|||  :  |||//  \
#            /  _||||| -:- |||||-  \
#            |   | \\\  -  /// |   |
#            | \_|  ''\---/''  |   |
#            \  .-\__  `-`  ___/-. /
#          ___`. .'  /--.--\  `. . __
#       ."" '<  `.___\_<|>_/___.'  >'"".
#      | | :  `- \`.;`\ _ /`;.`/ - ` : | |
#      \  \ `-.   \_ __\ /__ _/   .-` /  /
# ======`-.____`-.___\_____/___.-`____.-'======
#                    `=---='
# ^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^
#             佛祖保佑       永无BUG


# 主体-------------------------------------

if __name__ == "__main__":

    env = Environment()
    
    target_angles = np.array([-80.339, 64.029, -49.259, 164.373, -280.029, -22.804])
    # target_angles = np.array([-121.464, 53.761, -33.861, 161.560, -237.948, -5.135])
    initial_angles = np.array([0, 0, 0, 0, 0, 0])

    env.target_angles = target_angles
    env.initial_angles = initial_angles

    train = Train(env)
    fileio = ReadAndWritefile(train)

    train.train()

    
